# Итоговая контрольная работа по основному блоку. #

Написать программу, которая из имеющегося массива строк формирует новый массив из строк, длина которых меньше, либо равна 3 символам. Первоначальный массив можно ввести с клавиатуры, либо задать на старте выполнения алгоритма. При решении не рекомендуется пользоваться коллекциями, лучше обойтись исключительно массивами.

1. Создать репозиторий на GitHub
2. Нарисовать блок-схему алгоритма (можно обойтись блок-схемой основной содержательной части, если вы выделяете её в отдельный метод)
3. Снабдить репозиторий оформленным текстовым описанием решения (файл README.md)
4. Написать программу, решающую поставленную задачу
5. Использовать контроль версий в работе над этим небольшим проектом (не должно быть так, что всё залито одним коммитом, как минимум этапы 2, 3, и 4 должны быть расположены в разных коммитах)

## Содержаниею ##

* Технологии.
* Описание кода.
* Составление блок схемы работы алгоритма.
* Написание README.md.
* Тестирование работоспособности кода. 

## Технологии. ##

Visual studio code v 1.85.1

1. Расширения для VSC:
* .NET Install Tool
* C#
* C# Dev Kit
* IntelliCode 
* IntelliCode for C# Dev Kit
* IntelliCode API Usage Examples

2.  C# V 11
3. https://app.diagrams.net/
4. https://github.com/

## Описание кода. ##

1.  **Выводим сообщение для пользователя: Условия ввода значений.
System.Console.Write($"Введите значения через запятую в одну строчку для использования в массиве: ")** 
2. **Создаем переменную в которую вкладывается значение от пользователя.** 
3. **Создаем метод CreateArray для создания исходного массива через Split.**
* Создаем массив прсваеваем ему значение переменной через функцию Split.
4. **Создаем метод PrintArray для вывода массива. (Использовался только для конечного массива.)**
* Перебираем элементы массива через цикл For, через запятую. 
5. **Создаем метод FinalArray для создания массива согласно условиям задачи.(аписать программу, которая из имеющегося массива строк формирует новый массив из строк, длина которых меньше, либо равна 3 символам. )**
* Создаем массив, которому присваиваем значение метода CreateArray.
* Создаем создаем строчную переменную, оставляем пустой String.Empty.
* Через цикл For перебираем значения. 
* Внутри цикла  for  создаем цикл If и проверяем условие: "Длина значений равна или меньше трех символов. 
* Значения удовлетворяющие условиям вкладываем в строчную переменную.
* Создаем массив строчного типа в который вкладываем переменную и используем функцию Split. 
Возвращаем массив return NewArray.
6. **Выводим исходный массив и конечный.**

* Создаем пустой строчный массив и присваиваем значение метода CreateArray.
* Выводим исходный массив System.Console.WriteLine($"Исходный массив: [{string.Join(", ", array)}]").
* Вызываем метод PrintArray и выводим конечный массив. 

## Составление блок схемы работы алгоритма. ##
 Приложенный изображения

## Тестирование работоспособности кода. ##
Проверка успешна.
Алгоритм работает, согласно заданным условиям.
